phase-1/03-single-vs-multiple-workers/observations/large_load/autocanon_output.txt
autocannon -c 2000 -d 30 http://localhost:8080/
Running 30s test @ http://localhost:8080/
2000 connections


┌─────────┬───────┬────────┬─────────┬─────────┬───────────┬───────────┬──────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%   │ 99%     │ Avg       │ Stdev     │ Max      │
├─────────┼───────┼────────┼─────────┼─────────┼───────────┼───────────┼──────────┤
│ Latency │ 23 ms │ 288 ms │ 2948 ms │ 3825 ms │ 629.78 ms │ 846.18 ms │ 10869 ms │
└─────────┴───────┴────────┴─────────┴─────────┴───────────┴───────────┴──────────┘
┌───────────┬────────┬────────┬────────┬─────────┬──────────┬──────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%   │ Avg      │ Stdev    │ Min    │
├───────────┼────────┼────────┼────────┼─────────┼──────────┼──────────┼────────┤
│ Req/Sec   │ 392    │ 392    │ 1,593  │ 12,919  │ 3,307.37 │ 3,633.13 │ 392    │
├───────────┼────────┼────────┼────────┼─────────┼──────────┼──────────┼────────┤
│ Bytes/Sec │ 103 kB │ 103 kB │ 473 kB │ 2.57 MB │ 758 kB   │ 659 kB   │ 103 kB │
└───────────┴────────┴────────┴────────┴─────────┴──────────┴──────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

69209 2xx responses, 30008 non 2xx responses
102k requests in 30.11s, 22.7 MB read
145 errors (10 timeouts)